; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	satellite4 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	thermograph3 - mode
	image1 - mode
	spectrograph4 - mode
	thermograph0 - mode
	infrared2 - mode
	GroundStation1 - direction
	Star0 - direction
	Star2 - direction
	Planet3 - direction
	Planet4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Star18 - direction
	Phenomenon19 - direction
	Star20 - direction
	Phenomenon21 - direction
	Phenomenon22 - direction
	Planet23 - direction
	Star24 - direction
	Planet25 - direction
	Planet26 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon21)
	(supports instrument1 image1)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star18)
	(supports instrument2 spectrograph4)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star2)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star13)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star0)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet10)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star2)
	(supports instrument5 thermograph0)
	(supports instrument5 spectrograph4)
	(supports instrument5 image1)
	(calibration_target instrument5 Star2)
	(supports instrument6 infrared2)
	(calibration_target instrument6 Star2)
	(on_board instrument4 satellite4)
	(on_board instrument5 satellite4)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon15)
)
(:goal (and
	(pointing satellite0 Planet10)
	(pointing satellite2 Phenomenon15)
	(have_image Planet3 spectrograph4)
	(have_image Planet4 infrared2)
	(have_image Phenomenon5 spectrograph4)
	(have_image Phenomenon6 thermograph3)
	(have_image Phenomenon7 thermograph3)
	(have_image Planet8 thermograph3)
	(have_image Planet10 spectrograph4)
	(have_image Star11 thermograph3)
	(have_image Star12 image1)
	(have_image Star13 spectrograph4)
	(have_image Star14 infrared2)
	(have_image Phenomenon15 spectrograph4)
	(have_image Planet16 image1)
	(have_image Star18 image1)
	(have_image Phenomenon19 spectrograph4)
	(have_image Phenomenon21 spectrograph4)
	(have_image Phenomenon22 thermograph3)
	(have_image Planet23 thermograph3)
	(have_image Star24 infrared2)
	(have_image Planet25 thermograph0)
	(have_image Planet26 thermograph3)
))

)

; plan
1. (switch_on instrument5 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument5)
   goals met: 0 of 23
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 23
3. (turn_to satellite4 star2 phenomenon15)
   deleted: (pointing satellite4 phenomenon15)
   added: (pointing satellite4 star2)
   goals met: 0 of 23
4. (calibrate satellite4 instrument5 star2)
   added: (calibrated instrument5)
   goals met: 0 of 23
5. (turn_to satellite2 phenomenon15 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 phenomenon15)
   goals met: 1 of 23
6. (turn_to satellite1 groundstation1 star18)
   deleted: (pointing satellite1 star18)
   added: (pointing satellite1 groundstation1)
   goals met: 1 of 23
7. (calibrate satellite1 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 1 of 23
8. (turn_to satellite1 phenomenon22 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon22)
   goals met: 1 of 23
9. (take_image satellite1 phenomenon22 instrument1 thermograph3)
   added: (have_image phenomenon22 thermograph3)
   goals met: 2 of 23
10. (turn_to satellite1 phenomenon6 phenomenon22)
   deleted: (pointing satellite1 phenomenon22)
   added: (pointing satellite1 phenomenon6)
   goals met: 2 of 23
11. (take_image satellite1 phenomenon6 instrument1 thermograph3)
   added: (have_image phenomenon6 thermograph3)
   goals met: 3 of 23
12. (turn_to satellite1 phenomenon7 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon7)
   goals met: 3 of 23
13. (take_image satellite1 phenomenon7 instrument1 thermograph3)
   added: (have_image phenomenon7 thermograph3)
   goals met: 4 of 23
14. (turn_to satellite1 planet16 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet16)
   goals met: 4 of 23
15. (take_image satellite1 planet16 instrument1 image1)
   added: (have_image planet16 image1)
   goals met: 5 of 23
16. (turn_to satellite1 planet23 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet23)
   goals met: 5 of 23
17. (take_image satellite1 planet23 instrument1 thermograph3)
   added: (have_image planet23 thermograph3)
   goals met: 6 of 23
18. (turn_to satellite1 planet25 planet23)
   deleted: (pointing satellite1 planet23)
   added: (pointing satellite1 planet25)
   goals met: 6 of 23
19. (take_image satellite1 planet25 instrument1 thermograph0)
   added: (have_image planet25 thermograph0)
   goals met: 7 of 23
20. (turn_to satellite1 planet26 planet25)
   deleted: (pointing satellite1 planet25)
   added: (pointing satellite1 planet26)
   goals met: 7 of 23
21. (take_image satellite1 planet26 instrument1 thermograph3)
   added: (have_image planet26 thermograph3)
   goals met: 8 of 23
22. (turn_to satellite1 planet8 planet26)
   deleted: (pointing satellite1 planet26)
   added: (pointing satellite1 planet8)
   goals met: 8 of 23
23. (take_image satellite1 planet8 instrument1 thermograph3)
   added: (have_image planet8 thermograph3)
   goals met: 9 of 23
24. (turn_to satellite1 star11 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star11)
   goals met: 9 of 23
25. (take_image satellite1 star11 instrument1 thermograph3)
   added: (have_image star11 thermograph3)
   goals met: 10 of 23
26. (turn_to satellite1 star12 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star12)
   goals met: 10 of 23
27. (take_image satellite1 star12 instrument1 image1)
   added: (have_image star12 image1)
   goals met: 11 of 23
28. (turn_to satellite1 star18 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star18)
   goals met: 11 of 23
29. (take_image satellite1 star18 instrument1 image1)
   added: (have_image star18 image1)
   goals met: 12 of 23
30. (turn_to satellite0 planet10 phenomenon21)
   deleted: (pointing satellite0 phenomenon21)
   added: (pointing satellite0 planet10)
   goals met: 13 of 23
31. (turn_to satellite4 phenomenon15 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 phenomenon15)
   goals met: 13 of 23
32. (take_image satellite4 phenomenon15 instrument5 spectrograph4)
   added: (have_image phenomenon15 spectrograph4)
   goals met: 14 of 23
33. (turn_to satellite4 phenomenon19 phenomenon15)
   deleted: (pointing satellite4 phenomenon15)
   added: (pointing satellite4 phenomenon19)
   goals met: 14 of 23
34. (take_image satellite4 phenomenon19 instrument5 spectrograph4)
   added: (have_image phenomenon19 spectrograph4)
   goals met: 15 of 23
35. (switch_off instrument5 satellite4)
   deleted: (power_on instrument5)
   added: (power_avail satellite4)
   goals met: 15 of 23
36. (switch_on instrument6 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument6)
   goals met: 15 of 23
37. (turn_to satellite4 phenomenon21 phenomenon19)
   deleted: (pointing satellite4 phenomenon19)
   added: (pointing satellite4 phenomenon21)
   goals met: 15 of 23
38. (turn_to satellite4 star2 phenomenon21)
   deleted: (pointing satellite4 phenomenon21)
   added: (pointing satellite4 star2)
   goals met: 15 of 23
39. (calibrate satellite4 instrument6 star2)
   added: (calibrated instrument6)
   goals met: 15 of 23
40. (turn_to satellite4 phenomenon21 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 phenomenon21)
   goals met: 15 of 23
41. (turn_to satellite4 planet4 phenomenon21)
   deleted: (pointing satellite4 phenomenon21)
   added: (pointing satellite4 planet4)
   goals met: 15 of 23
42. (take_image satellite4 planet4 instrument6 infrared2)
   added: (have_image planet4 infrared2)
   goals met: 16 of 23
43. (turn_to satellite4 phenomenon21 planet4)
   deleted: (pointing satellite4 planet4)
   added: (pointing satellite4 phenomenon21)
   goals met: 16 of 23
44. (turn_to satellite4 star14 phenomenon21)
   deleted: (pointing satellite4 phenomenon21)
   added: (pointing satellite4 star14)
   goals met: 16 of 23
45. (take_image satellite4 star14 instrument6 infrared2)
   added: (have_image star14 infrared2)
   goals met: 17 of 23
46. (turn_to satellite4 phenomenon21 star14)
   deleted: (pointing satellite4 star14)
   added: (pointing satellite4 phenomenon21)
   goals met: 17 of 23
47. (turn_to satellite4 star24 phenomenon21)
   deleted: (pointing satellite4 phenomenon21)
   added: (pointing satellite4 star24)
   goals met: 17 of 23
48. (take_image satellite4 star24 instrument6 infrared2)
   added: (have_image star24 infrared2)
   goals met: 18 of 23
49. (switch_off instrument6 satellite4)
   deleted: (power_on instrument6)
   added: (power_avail satellite4)
   goals met: 18 of 23
50. (turn_to satellite4 phenomenon21 star24)
   deleted: (pointing satellite4 star24)
   added: (pointing satellite4 phenomenon21)
   goals met: 18 of 23
51. (switch_on instrument5 satellite4)
   deleted: (calibrated instrument5) (power_avail satellite4)
   added: (power_on instrument5)
   goals met: 18 of 23
52. (turn_to satellite4 star2 phenomenon21)
   deleted: (pointing satellite4 phenomenon21)
   added: (pointing satellite4 star2)
   goals met: 18 of 23
53. (calibrate satellite4 instrument5 star2)
   added: (calibrated instrument5)
   goals met: 18 of 23
54. (turn_to satellite4 phenomenon21 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 phenomenon21)
   goals met: 18 of 23
55. (take_image satellite4 phenomenon21 instrument5 spectrograph4)
   added: (have_image phenomenon21 spectrograph4)
   goals met: 19 of 23
56. (turn_to satellite4 phenomenon5 phenomenon21)
   deleted: (pointing satellite4 phenomenon21)
   added: (pointing satellite4 phenomenon5)
   goals met: 19 of 23
57. (take_image satellite4 phenomenon5 instrument5 spectrograph4)
   added: (have_image phenomenon5 spectrograph4)
   goals met: 20 of 23
58. (turn_to satellite4 planet10 phenomenon5)
   deleted: (pointing satellite4 phenomenon5)
   added: (pointing satellite4 planet10)
   goals met: 20 of 23
59. (take_image satellite4 planet10 instrument5 spectrograph4)
   added: (have_image planet10 spectrograph4)
   goals met: 21 of 23
60. (turn_to satellite4 planet3 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 planet3)
   goals met: 21 of 23
61. (take_image satellite4 planet3 instrument5 spectrograph4)
   added: (have_image planet3 spectrograph4)
   goals met: 22 of 23
62. (turn_to satellite4 star13 planet3)
   deleted: (pointing satellite4 planet3)
   added: (pointing satellite4 star13)
   goals met: 22 of 23
63. (take_image satellite4 star13 instrument5 spectrograph4)
   added: (have_image star13 spectrograph4)
   goals met: 23 of 23
